Tekla.Structures.ModelInternal.dotEdges_t
DO NOT USE! For internal usage only!

Tekla.Structures.ModelInternal.dotEdges_t.nEdges
Number of edges in solid.

Tekla.Structures.ModelInternal.dotEdges_t.EdgeType
The edge types of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.StartX
The x-coordinates of start points of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.StartY
The y-coordinates of start points of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.StartZ
The z-coordinates of start points of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.EndX
The x-coordinates of end points of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.EndY
The y-coordinates of end points of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.EndZ
The z-coordinates of end points of all edges.

Tekla.Structures.ModelInternal.dotEdges_t.GetEdges
Get edges in ArrayList.
Returns: ArrayList of polygon Points